; domain
; source => https://github.com/AI-Planning/pddl-generators/blob/main/spanner/domain.pddl
(define (domain spanner)
(:requirements :typing :strips)
(:types
	location locatable - object
	man nut spanner - locatable
)

(:predicates
	(at ?m - locatable ?l - location)
	(carrying ?m - man ?s - spanner)
	(usable ?s - spanner)
	(link ?l1 - location ?l2 - location)
	(tightened ?n - nut)
	(loose ?n - nut))

(:action walk
        :parameters (?start - location ?end - location ?m - man)
        :precondition (and (at ?m ?start)
                           (link ?start ?end))
        :effect (and (not (at ?m ?start)) (at ?m ?end)))

(:action pickup_spanner
        :parameters (?l - location ?s - spanner ?m - man)
        :precondition (and (at ?m ?l)
                           (at ?s ?l))
        :effect (and (not (at ?s ?l))
                     (carrying ?m ?s)))

(:action tighten_nut
        :parameters (?l - location ?s - spanner ?m - man ?n - nut)
        :precondition (and (at ?m ?l)
		      	   (at ?n ?l)
			   (carrying ?m ?s)
			   (usable ?s)
			   (loose ?n))
        :effect (and (not (loose ?n))(not (usable ?s)) (tightened ?n)))
)

; problem
(define (problem spanner-68)
 (:domain spanner)
 (:objects 
    bob - man
    spanner1 spanner2 spanner3 spanner4 spanner5 spanner6 spanner7 - spanner
    nut1 nut2 nut3 nut4 - nut
    shed location1 location2 location3 location4 location5 location6 location7 location8 gate - location
 )
 (:init 
    (at bob shed)
    (at spanner1 location3)
    (usable spanner1)
    (at spanner2 location8)
    (usable spanner2)
    (at spanner3 location1)
    (usable spanner3)
    (at spanner4 location3)
    (usable spanner4)
    (at spanner5 location1)
    (usable spanner5)
    (at spanner6 location2)
    (usable spanner6)
    (at spanner7 location5)
    (usable spanner7)
    (at nut1 gate)
    (loose nut1)
    (at nut2 gate)
    (loose nut2)
    (at nut3 gate)
    (loose nut3)
    (at nut4 gate)
    (loose nut4)
    (link shed location1)
    (link location8 gate)
    (link location1 location2)
     (link location2 location3)
     (link location3 location4)
     (link location4 location5)
     (link location5 location6)
     (link location6 location7)
     (link location7 location8)
 )
 (:goal (and 
(tightened nut4)
))
)

; plan
1. (walk shed location1 bob)
   deleted: (at bob shed)
   added: (at bob location1)
   goals met: 0 of 1
2. (walk location1 location2 bob)
   deleted: (at bob location1)
   added: (at bob location2)
   goals met: 0 of 1
3. (walk location2 location3 bob)
   deleted: (at bob location2)
   added: (at bob location3)
   goals met: 0 of 1
4. (walk location3 location4 bob)
   deleted: (at bob location3)
   added: (at bob location4)
   goals met: 0 of 1
5. (walk location4 location5 bob)
   deleted: (at bob location4)
   added: (at bob location5)
   goals met: 0 of 1
6. (walk location5 location6 bob)
   deleted: (at bob location5)
   added: (at bob location6)
   goals met: 0 of 1
7. (walk location6 location7 bob)
   deleted: (at bob location6)
   added: (at bob location7)
   goals met: 0 of 1
8. (walk location7 location8 bob)
   deleted: (at bob location7)
   added: (at bob location8)
   goals met: 0 of 1
9. (pickup_spanner location8 spanner2 bob)
   deleted: (at spanner2 location8)
   added: (carrying bob spanner2)
   goals met: 0 of 1
10. (walk location8 gate bob)
   deleted: (at bob location8)
   added: (at bob gate)
   goals met: 0 of 1
11. (tighten_nut gate spanner2 bob nut4)
   deleted: (loose nut4) (usable spanner2)
   added: (tightened nut4)
   goals met: 1 of 1
